In [1]:
import pandas as pd
import mysql.connector
from mysql.connector import Error

In [2]:
# create server connection

def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            password = user_password
        )
        print('MySQL Database connection sussefull.')
    
    except Error as err:
        print(f'Error: {err}')
    
    return connection

In [3]:
pw = 'password'
db = 'mysql_python'

connection = create_server_connection('localhost', 'root', pw)

MySQL Database connection sussefull.

In [4]:
# create mysql_python database

def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print('Database created successfully.')
    except Error as err:
        print(f'Error: {err}')

In [5]:
create_db_query = f'create database if not exists {db}'

create_database(connection, create_db_query)

Database created successfully.

In [6]:
# connect to a database

def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            password = user_password,
            database = db_name
        )
        print('MySQL database connection successful')
    
    except Error as err:
        print(f'Error: {err}')
        
    return connection

In [7]:
# Execute sql queries

def execute_query(connection, query):
    cursor = connection.cursor() # to estalished and run sql statement
    try:
        cursor.execute(query)
        connection.commit()
        print('Query executed successfully.')
    except Error as err:
        print(f'Error: {err}')

In [8]:
create_orders_table = """
create table if not exists orders(
    order_id int primary key,
    customer_name varchar(30) not null,
    product_name varchar(20) not null,
    date_ordered date,
    quantity int,
    unit_price float,
    phone_number varchar(20)
);
"""

# connect to the database
connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, create_orders_table)

MySQL database connection successful
Query executed successfully.

In [11]:
# read everything from sql table

def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f'Error: {err}')

In [12]:
# fetch everything from sql table and show them in a dataframe

def select_all_from(table):
    connection = create_db_connection('localhost', 'root', pw, db)
    results = read_query(connection, f'select * from {table}')
    from_db = []
    for result in results:
        from_db.append(list(result))
    df = pd.DataFrame(from_db)
    print(df)

In [13]:
select_all_from('orders')

MySQL database connection successful
     0       1          2           3   4       5             6
0  101   steve     Laptop  2018-06-12   2   800.0    6293730802
1  102  Mehedi       Book  2015-06-12  10   200.0   57527522725
2  103   Hasan     Tshirt  2018-08-12   3    45.0  786543453453
3  104   Bijoy        pen  2018-06-15   5     5.0     527523752
4  106   Nancy     Laptop  2020-06-12   1   750.0    2445633757
5  107   Kohli  Iphone 13  2019-06-12   4  1000.0     245722722

In [14]:
# Insert data

data_orders = """
insert into orders values
    (101, 'steve', 'Laptop', '2018-06-12', 2, 800, '6293730802'),
    (102, 'Mehedi', 'Book', '2015-06-12', 10, 200, '57527522725'),
    (103, 'Hasan', 'Tshirt', '2018-08-12', 3, 60, '786543453453'),
    (104, 'Bijoy', 'pen', '2018-06-15', 5, 5, '527523752'),
    (105, 'Mehedi', 'Tshirt', '2018-06-12', 1, 50, '763435752'),
    (106, 'Nancy', 'Laptop', '2020-06-12', 1, 750, '2445633757'),
    (107, 'Kohli', 'Iphone 13', '2019-06-12', 4, 1000, '245722722');
"""

connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, data_orders)

MySQL database connection successful
Error: 1062 (23000): Duplicate entry '101' for key 'orders.PRIMARY'

In [15]:
# using the select statement

query = """
select * from orders;
"""

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, query)

for result in results:
    print(result)

MySQL database connection successful
(101, 'steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(102, 'Mehedi', 'Book', datetime.date(2015, 6, 12), 10, 200.0, '57527522725')
(103, 'Hasan', 'Tshirt', datetime.date(2018, 8, 12), 3, 45.0, '786543453453')
(104, 'Bijoy', 'pen', datetime.date(2018, 6, 15), 5, 5.0, '527523752')
(106, 'Nancy', 'Laptop', datetime.date(2020, 6, 12), 1, 750.0, '2445633757')
(107, 'Kohli', 'Iphone 13', datetime.date(2019, 6, 12), 4, 1000.0, '245722722')

In [16]:
query = """
select customer_name, phone_number from orders;
"""

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, query)

for result in results:
    print(result)

MySQL database connection successful
('steve', '6293730802')
('Mehedi', '57527522725')
('Hasan', '786543453453')
('Bijoy', '527523752')
('Nancy', '2445633757')
('Kohli', '245722722')

In [17]:
query = """
select * from orders;
"""

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, query)

from_db = []
for result in results:
    from_db.append(list(result))
    
columns = ['id', 'name', 'product', 'date', 'quantity', 'price', 'phone']
pd.DataFrame(from_db, columns = columns)

MySQL database connection successful

    id    name    product        date  quantity   price         phone
0  101   steve     Laptop  2018-06-12         2   800.0    6293730802
1  102  Mehedi       Book  2015-06-12        10   200.0   57527522725
2  103   Hasan     Tshirt  2018-08-12         3    45.0  786543453453
3  104   Bijoy        pen  2018-06-15         5     5.0     527523752
4  106   Nancy     Laptop  2020-06-12         1   750.0    2445633757
5  107   Kohli  Iphone 13  2019-06-12         4  1000.0     245722722

In [18]:
# query = """
# select customer_name, phone_number, year(date_ordered) from orders;
# """
query = """
select * 
from orders
where year(date_ordered) = 2018
order by unit_price desc;
"""

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, query)

for result in results:
    print(result)

MySQL database connection successful
(101, 'steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(103, 'Hasan', 'Tshirt', datetime.date(2018, 8, 12), 3, 45.0, '786543453453')
(104, 'Bijoy', 'pen', datetime.date(2018, 6, 15), 5, 5.0, '527523752')

In [19]:
# create a dataframe

from_db = []
for result in results:
    result = list(result)
    from_db.append(result)
columns = ['order_id', 'customer_name', 'product_name', 'date_ordered', 'quantity', 'unit_price', 'phone_number']

df = pd.DataFrame(from_db, columns = columns)
df

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,101,steve,Laptop,2018-06-12,2,800.0,6293730802
1,103,Hasan,Tshirt,2018-08-12,3,45.0,786543453453
2,104,Bijoy,pen,2018-06-15,5,5.0,527523752

In [20]:
# update column

update = """
update orders set unit_price = 45
where order_id = 103
"""

connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, update)

MySQL database connection successful
Query executed successfully.

In [21]:
select_all_from('orders')

MySQL database connection successful
     0       1          2           3   4       5             6
0  101   steve     Laptop  2018-06-12   2   800.0    6293730802
1  102  Mehedi       Book  2015-06-12  10   200.0   57527522725
2  103   Hasan     Tshirt  2018-08-12   3    45.0  786543453453
3  104   Bijoy        pen  2018-06-15   5     5.0     527523752
4  106   Nancy     Laptop  2020-06-12   1   750.0    2445633757
5  107   Kohli  Iphone 13  2019-06-12   4  1000.0     245722722

In [22]:
query = """
select * 
from orders
where order_id = 103
"""

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, query)

from_db = []
for result in results:
    from_db.append(list(result))

columns = ['id', 'name', 'product', 'date', 'quantity', 'price', 'phone']
pd.DataFrame(from_db, columns = columns)

MySQL database connection successful

    id   name product        date  quantity  price         phone
0  103  Hasan  Tshirt  2018-08-12         3   45.0  786543453453

In [23]:
# delete comman

delete_order = '''
delete from orders
where order_id = 105;
'''

connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, delete_order)

MySQL database connection successful
Query executed successfully.

In [24]:
select_all_from('orders')

MySQL database connection successful
     0       1          2           3   4       5             6
0  101   steve     Laptop  2018-06-12   2   800.0    6293730802
1  102  Mehedi       Book  2015-06-12  10   200.0   57527522725
2  103   Hasan     Tshirt  2018-08-12   3    45.0  786543453453
3  104   Bijoy        pen  2018-06-15   5     5.0     527523752
4  106   Nancy     Laptop  2020-06-12   1   750.0    2445633757
5  107   Kohli  Iphone 13  2019-06-12   4  1000.0     245722722